

#+title: gzip file format abuse
#+subtitle:
#+hugo_section: articles
#+export_file_name: gzip-file-format-abuse
#+hugo_tags: 
#+hugo_categories: 
#+hugo_publishdate: 2022-04-24
#+hugo_auto_set_lastmod: t
#+hugo_custom_front_matter: :math true

I've been abusing the gzip file format and realize the Unix world has
missed an opportunity and it is probably impossible to reclaim it.

#+hugo: more

* When it all falls apart

After implementing a prototype writer in Python (named ~gzit.py~ -
"gzipped, indexed tar-like") I was able to produce some test files and
see how standard ~gunzip~ handles them.  Well, it doesn't.

Despite the promise from the ~gzip/gunzip~ man page discussion on their
~-N/--name~ option:

#+begin_quote
When compressing, always save the original file name and timestamp;
this is the default. When decompressing, restore the original file
name and timestamp if present.  This option is useful on systems which
have a limit on file name length or when the timestamp has been lost
after a file transfer.
#+end_quote


Most critical is it speaks in singular about the file which I didn't
catch at first.  It does not imply that subsequent members in the ~gzip~
file will be unpacked to their original file names.  Indeed, ~gunzip~
applies a "first file wins all the data" rule.  And, I didn't need to
prototype this crazy scheme to learn that.

#+begin_src shell :exports both :results output code :wrap example
echo aaa > a.txt
echo bbb > b.txt
gzip -N {a,b}.txt
cat {a,b}.txt.gz > ab.txt.gz
rm -f {a,b}.txt{,.gz}
echo "> zcat"
zcat ab.txt.gz
echo "> gzip -lv"
gzip -lv ab.txt.gz
echo "> od -d ab.txt.gz"
od -a ab.txt.gz
gunzip -N ab.txt.gz
echo "> just a.txt"
cat a.txt
#+end_src

#+RESULTS:
#+begin_example
> zcat
aaa
bbb
> gzip -lv
method  crc     date  time           compressed        uncompressed  ratio uncompressed_name
defla 4c261fe1 Apr 24 17:53                  60                   4 -800.0% ab.txt
> od -d ab.txt.gz
0000000  us  vt  bs  bs   E   F   e   b nul etx   a   .   t   x   t nul
0000020   K   L   L   d stx nul nak   ]   x   w eot nul nul nul  us  vt
0000040  bs  bs   E   F   e   b nul etx   b   .   t   x   t nul   K   J
0000060   J   b stx nul   a  us   &   L eot nul nul nul
0000074
> just a.txt
aaa
bbb
#+end_example


You can see ~a.txt~ and ~b.txt~ file names are stored in the gzip header
but no ~b.txt~ is produced and ~a.txt~ includes the contents from ~b.txt~.

